{
  "2.0.0": {
    "en": "Added air-to-water heat pump support."
  },
  "3.0.0": {
    "en": "Migrated to Homey SDK 3. Fixed multi-floor device search. Fixed air-to-air fan & dry modes, horizontal vane control and various bugs."
  },
  "3.0.4": {
    "en": "Devices are now filtered according to their type (air-to-air vs air-to-water) when adding ones."
  },
  "3.1.0": {
    "en": "Added logs. Fixed and improved flow cards. Some capabilities or settings have been moved to benefit from the best Homey features. Some value names have changed for more compliance with MELCloud, so you may need to update some of your flows if necessary. Fixed a air-to-water sync issue when a second zone is configured."
  },
  "4.0.0": {
    "en": "Added power consumption reporting and reshaped air-to-water device display: 2-zone device are now handled with the same device, and measured temperature are shown with target temperature when possible."
  },
  "5.0.0": {
    "en": "Redesigned app core and improved device sync."
  },
  "5.1.0": {
    "en": "Energy measurement display can be customized from settings."
  },
  "5.1.1": {
    "en": "Made other capabilities available for display or not from settings."
  },
  "5.1.2": {
    "en": "Added missing triggers."
  },
  "5.2.0": {
    "en": "Improved sync to avoid overlaps with other sources."
  },
  "5.2.1": {
    "en": "Fixed bugs, including horizontal vane control and reports not processed daily."
  },
  "5.2.3": {
    "en": "Added notifications about new features."
  },
  "5.3.0": {
    "en": "Improved sync by agglomerating requests to MELCloud, reports will be processed every day at 0:00 AM UTC, updated some settings."
  },
  "5.4.0": {
    "en": "Added back an `Always On` option in settings."
  },
  "5.6.0": {
    "en": "Added Wi-Fi signal strength (can be enable from settings)."
  },
  "6.0.0": {
    "en": "Changed request library (axios). Added an always on setting also for air-to-air heat pumps. Added repairing support and daily authentication refresh (some users may need to authenticate again to make it work)."
  },
  "7.0.0": {
    "en": "Converted to TypeScript."
  },
  "7.2.0": {
    "en": "Energy reporting is now handled according to user timezone (and no more according UTC forced by Homey). Made available hourly consumption for air-to-air heat pumps (cannot be retrieved from MELCloud API for air-to-water heat pumps) and last daily consumption becomes the (cumulated) daily consumption and is updated every hour. Capabalities displayed in the dashboard can be customized from device settings."
  },
  "7.2.1": {
    "en": "Added community topic."
  },
  "8.0.0": {
    "en": "Redesigned capability and flow handling for performance improvement and code readability. Typed more and better. Added logs."
  },
  "8.0.1": {
    "en": "Fixed possible energy reporting issues."
  },
  "8.0.3": {
    "en": "Run backend tasks (login refresh, reporting) only when needed."
  },
  "8.0.7": {
    "en": "Taken into consideration that MELCloud time is at least 5 minutes late to run energy reports."
  },
  "9.0.0": {
    "en": "Added app settings."
  },
  "9.1.0": {
    "en": "Added device and building settings under app settings."
  },
  "11.0.0": {
    "en": "Translated into French."
  },
  "11.1.0": {
    "en": "Translated into Dutch, Swedish and Spanish."
  },
  "11.2.0": {
    "en": "Added Norwegian and improved other languages."
  },
  "12.0.0": {
    "en": "Improved 2-zone and/or cooling devices."
  },
  "12.1.0": {
    "en": "Translated into Danish."
  },
  "13.0.0": {
    "en": "Added a section dedicated to air-to-air heat pump customers in the application settings."
  },
  "14.0.0": {
    "en": "Improved app memory consumption, devices are now updated every minute."
  },
  "15.0.0": {
    "en": "Enhanced app settings and added new capabilities."
  },
  "15.0.1": {
    "en": "Added live consumption! (refreshed every 3 minutes for air-to-water devices, and on a hourly basis for air-to-air devices)."
  },
  "15.1.0": {
    "en": "Optimized loops (task parallelization)."
  },
  "16.0.0": {
    "en": "Reshaped error management."
  },
  "17.0.0": {
    "en": "Improved memory usage and enhanced app settings."
  },
  "17.1.0": {
    "en": "Use Map()"
  },
  "18.0.0": {
    "en": "If you haven't already done so following the notification posted several months ago, it is now necessary to delete your air-to-water devices and recreate them: this will enable you to benefit from all the app's new features (new settings, new capabilities, etc.). Your flows will also have to be recreated (once and for all, don't worry!)."
  },
  "19.0.0": {
    "en": "Updated modules."
  },
  "20.0.0": {
    "en": "Use eslint flat config."
  },
  "20.1.0": {
    "en": "Use mixins."
  },
  "21.0.0": {
    "en": "Reshaped code."
  },
  "22.0.0": {
    "en": "Use decorator."
  },
  "23.0.0": {
    "en": "Introduce ERV devices in Homey."
  },
  "24.0.0": {
    "en": "Implemented session refresh in case of failure."
  },
  "25.0.0": {
    "en": "Reshaped power/energy capabilities and added new air-to-water device capabilities."
  },
  "26.0.0": {
    "en": "Use array functions."
  },
  "27.1.0": {
    "en": "Air-to-water devices: improved `forced hot water` action flow with new checkbox type: existing cards does not need to be recreated but may need to be updated."
  },
  "28.0.0": {
    "en": "Improved types."
  },
  "29.0.0": {
    "en": "Improved performances."
  },
  "30.0.0": {
    "en": "Enhanced performances."
  },
  "31.0.0": {
    "en": "Improved error handling."
  },
  "32.0.0": {
    "en": "Improved API management."
  },
  "32.1.0": {
    "en": "Added wide horizontal mode (for air-to-air devices)."
  },
  "32.3.0": {
    "en": "Improved fan_power handling (air-to-air and erv devices)."
  },
  "33.0.0": {
    "en": "Added new capabilities: readonly silent mode and outdoor temperature (air-to-air devices), prohibit (air-to-water devices)."
  },
  "34.0.0": {
    "en": "Improved device pairing."
  },
  "35.0.0": {
    "en": "Modularized API management."
  },
  "36.0.0": {
    "en": "Improved API architecture design."
  },
  "37.0.0": {
    "en": "Moved drivers to heatpump class"
  },
  "37.0.1": {
    "en": "It is now possible to change the main capability displayed on your device! To take advantage of this feature, you need to recreate your device and the associated flows."
  },
  "38.0.0": {
    "da": "⚠️ **Brudændring** ⚠️\nDenne udgivelse introducerer betydelige ændringer, der muligvis kræver, at du opdaterer eller genskaber nogle flows.\nHomey 12.0.1 firmwareopdateringen tillader nu tilpasning af termostattilstandsværdier.\nFor luft-til-luft-enheder kan driftstilstanden kombineres med termostattilstanden.\nFor luft-til-vand-enheder er der blevet foretaget forbedringer for at forenkle administration og vedligeholdelse.\nDesuden er et designproblem blevet løst, hvilket også kan løse nogle synkroniseringsproblemer.",
    "en": "⚠️ **Breaking change** ⚠️\nThis release introduces significant changes that may require you to update or recreate some flows.\nThe Homey 12.0.1 firmware update now allows customization of thermostat mode values.\nFor air-to-air devices, the operational mode can be merged with the thermostat mode.\nAs for air-to-water devices, improvements have been made to simplify management and maintenance.\nAdditionally, a design issue has been fixed, which may also resolve some synchronization problems.",
    "es": "⚠️ **Cambio importante** ⚠️\nEsta versión introduce cambios significativos que pueden requerir que actualices o recrees algunos flujos.\nLa actualización del firmware Homey 12.0.1 ahora permite la personalización de los valores del modo del termostato.\nPara los dispositivos de aire-aire, el modo operativo se puede fusionar con el modo del termostato.\nEn cuanto a los dispositivos de aire-agua, se han realizado mejoras para simplificar la gestión y el mantenimiento.\nAdemás, se ha corregido un problema de diseño, lo que también podría resolver algunos problemas de sincronización.",
    "fr": "⚠️ **Changement majeur** ⚠️\nCette version introduit des modifications importantes qui peuvent nécessiter une mise à jour ou une recréation de certains flux.\nLa mise à jour du firmware Homey 12.0.1 permet désormais de personnaliser les valeurs des modes du thermostat.\nPour les appareils air-air, le mode opérationnel peut être fusionné avec le mode du thermostat.\nQuant aux appareils air-eau, des améliorations ont été apportées pour simplifier la gestion et la maintenance.\nDe plus, un problème de conception a été corrigé, ce qui pourrait également résoudre certains problèmes de synchronisation.",
    "nl": "⚠️ **Belangrijke wijziging** ⚠️\nDeze release introduceert significante veranderingen die vereisen dat je sommige flows moet updaten of opnieuw moet aanmaken.\nDe Homey 12.0.1 firmware-update staat nu de aanpassing van thermostaatmoduswaarden toe.\nVoor lucht-naar-lucht-apparaten kan de operationele modus worden gecombineerd met de thermostaatmodus.\nVoor lucht-naar-water-apparaten zijn er verbeteringen aangebracht om het beheer en onderhoud te vereenvoudigen.\nDaarnaast is een ontwerpprobleem opgelost, wat ook enkele synchronisatieproblemen kan oplossen.",
    "no": "⚠️ **Betydelig endring** ⚠️\nDenne utgivelsen introduserer betydelige endringer som kan kreve at du oppdaterer eller gjenskaper noen flyter.\nHomey 12.0.1 fastvareoppdateringen tillater nå tilpasning av verdiene for termostatmodus.\nFor luft-til-luft-enheter kan driftsmodus slås sammen med termostatmodus.\nFor luft-til-vann-enheter er det gjort forbedringer for å forenkle administrasjon og vedlikehold.\nI tillegg er et designproblem løst, noe som også kan løse noen synkroniseringsproblemer.",
    "sv": "⚠️ **Större förändring** ⚠️\nDenna version inför betydande förändringar som kan kräva att du uppdaterar eller återskapar vissa flöden.\nHomey 12.0.1 firmwareuppdateringen tillåter nu anpassning av termostatlägevärden.\nFör luft-till-luft-enheter kan driftläget slås samman med termostatläget.\nFör luft-till-vatten-enheter har förbättringar gjorts för att förenkla hantering och underhåll.\nDessutom har ett designproblem åtgärdats, vilket även kan lösa vissa synkroniseringsproblem."
  },
  "38.0.1": {
    "en": "Fix a sync issue in some cases of failure."
  },
  "39.1.0": {
    "da": "I appindstillingerne: du kan nu se detaljerede indstillinger for hver zone (bygning, område og etage) og anvende masseændringer til dine luft-til-luft-enheders indstillinger for hver zone.",
    "en": "In the app settings: you can now view detailed settings for each zone (building, area and floor) and apply bulk changes to air-to-air device settings across zones.",
    "es": "En la configuración de la aplicación: ahora puedes ver los detalles de la configuración por zona (edificio, área y planta) y realizar cambios masivos en los valores de tus dispositivos aire-aire para cada zona.",
    "fr": "Dans les paramètres de l'application : vous pouvez désormais afficher les détails des paramètres pour chaque zone (bâtiment, zone et étage) et appliquer des modifications groupées aux réglages des dispositifs air-air pour chaque zone.",
    "nl": "In de app-instellingen: u kunt nu de gedetailleerde instellingen per zone (gebouw, gebied en verdieping) bekijken en bulk wijzigingen aanbrengen in de instellingen van uw lucht-lucht toestellen per zone.",
    "no": "I appinnstillingene: du kan nå se detaljerte innstillinger for hver sone (bygning, område og etasje) og gjøre masseendringer for luft-til-luft-enheter i hver sone.",
    "sv": "I appinställningarna: du kan nu se detaljerade inställningar per zon (byggnad, område och våning) och massändra dina luft-till-luft-enheters inställningar för varje zon."
  },
  "39.1.1": {
    "da": "Retter en fejl, hvor appen kan gå ned ved opstart.",
    "en": "Fixes a case of crash issue at app start.",
    "es": "Corrige un problema de bloqueo al iniciar la aplicación.",
    "fr": "Corrige un problème de plantage au démarrage de l'application.",
    "nl": "Verhelpt een crashprobleem bij het opstarten van de app.",
    "no": "Løser et problem med krasj ved oppstart av appen.",
    "sv": "Åtgärdar ett kraschproblem vid appstart."
  },
  "40.0.3": {
    "da": "✨ **Ny funktion** ✨\nEn widget til gruppestyring af luft-til-luft-enheder er blevet oprettet.\n⚠️ **Brudændring** ⚠️\nBrugen af de nye systemfunktioner i Homey kan kræve, at visse flow-kort skal genoprettes.",
    "en": "✨ **New feature** ✨\nA widget for grouped control of air-to-air devices has been created.\n⚠️ **Breaking change** ⚠️\nThe use of new Homey system capabilities may require some flow cards to be recreated.",
    "es": "✨ **Nueva función** ✨\nSe ha creado un widget para el control agrupado de dispositivos aire-aire.\n⚠️ **Cambio importante** ⚠️\nEl uso de las nuevas capacidades del sistema Homey puede requerir la recreación de algunas tarjetas de flujo.",
    "fr": "✨ **Nouvelle fonctionnalité** ✨\nUn widget permettant le contrôle groupé des appareils air-air a été créé.\n⚠️ **Changement majeur** ⚠️\nL’utilisation des nouvelles capacités système de Homey peut nécessiter la recréation de certaines cartes flow.",
    "nl": "✨ **Nieuwe functie** ✨\nEr is een widget gecreëerd voor gegroepeerde bediening van lucht-lucht apparaten.\n⚠️ **Belangrijke wijziging** ⚠️\nHet gebruik van de nieuwe Homey-systeemmogelijkheden kan vereisen dat sommige flowkaarten opnieuw worden gemaakt.",
    "no": "✨ **Ny funksjon** ✨\nEn widget for gruppekontroll av luft-til-luft-enheter er blitt opprettet.\n⚠️ **Betydelig endring** ⚠️\nBruken av de nye systemfunksjonene i Homey kan kreve at enkelte flytkort må opprettes på nytt.",
    "sv": "✨ **Ny funktion** ✨\nEn widget för gruppstyrning av luft-till-luft-enheter har skapats.\n⚠️ **Större förändring** ⚠️\nAnvändningen av de nya systemfunktionerna i Homey kan kräva att vissa flödeskort återskapas."
  },
  "40.1.0": {
    "da": "Det er nu muligt at deaktivere widget-animationer, hvilket kan forhindre, at widget'en fryser på nogle enheder.",
    "en": "It is now possible to disable widget animations, which can prevent the widget from freezing on some devices.",
    "es": "Ahora es posible desactivar las animaciones del widget, lo que puede evitar que se congele en algunos dispositivos.",
    "fr": "Il est désormais possible de désactiver les animations du widget, ce qui peut éviter qu'il ne se fige sur certains appareils.",
    "nl": "Het is nu mogelijk om widget-animaties uit te schakelen, wat kan voorkomen dat de widget op sommige apparaten vastloopt.",
    "no": "Det er nå mulig å deaktivere widget-animasjoner, noe som kan forhindre at widgeten fryser på enkelte enheter.",
    "sv": "Det är nu möjligt att inaktivera widget-animationer, vilket kan förhindra att widgeten fryser på vissa enheter."
  },
  "41.0.0": {
    "da": "✨ **Nye funktioner** ✨\n• MELCloud-dashboards er nu tilgængelige som widgets!\n• Du kan nu konfigurere et standardområde for hver widget.",
    "en": "✨ **New features** ✨\n• MELCloud dashboards are now available as widgets!\n• You can now set a default zone for each widget.",
    "es": "✨ **Nuevas funciones** ✨\n• ¡Los paneles de MELCloud ya están disponibles como widgets!\n• Ahora puedes configurar una zona predeterminada para cada widget.",
    "fr": "✨ **Nouvelles fonctionnalités** ✨\n• Les tableaux de bord MELCloud sont désormais disponibles en tant que widgets !\n• Vous pouvez désormais définir une zone par défaut pour chaque widget.",
    "nl": "✨ **Nieuwe functies** ✨\n• MELCloud-dashboards zijn nu beschikbaar als widgets!\n• Je kunt nu een standaardzone instellen voor elke widget.",
    "no": "✨ **Nye funksjoner** ✨\n• MELCloud-dashbords er nå tilgjengelige som widgets!\n• Du kan nå konfigurere en standard sone for hver widget.",
    "sv": "✨ **Nya funktioner** ✨\n• MELCloud-instrumentpaneler är nu tillgängliga som widgets!\n• Du kan nu konfigurera en standardzon för varje widget."
  },
  "42.0.0": {
    "en": "Major upgrade of Tailwind CSS & daisy UI."
  },
  "42.1.0": {
    "en": "Widget animations are no longer enabled by default."
  },
  "43.0.0": {
    "da": "Opdateret for kompatibilitet med Node.js 22 og senere, inklusive flere rettelser (bl.a. visning af forbudt tilstand).",
    "en": "Updated for compatibility with Node.js 22 and later, including several fixes (notably prohibited mode display).",
    "es": "Actualizado para compatibilidad con Node.js 22 y posteriores, incluyendo varias correcciones (en particular la visualización del modo prohibido).",
    "fr": "Mis à jour pour la compatibilité avec Node.js 22 et versions ultérieures, incluant plusieurs correctifs (notamment l’affichage du mode interdit).",
    "nl": "Bijgewerkt voor compatibiliteit met Node.js 22 en later, inclusief meerdere fixes (met name de weergave van verboden modi).",
    "no": "Oppdatert for kompatibilitet med Node.js 22 og senere, inkludert flere rettelser (spesielt visning av forbudt modus).",
    "sv": "Uppdaterad för kompatibilitet med Node.js 22 och senare, inklusive flera korrigeringar (särskilt visning av förbjudet läge)."
  }
}
